PROYECTO D.A.W/app/Controllers/AdminController.php

    public function animalTabla()
    {
        $session = session();
        if ($session->get('logged_in') != TRUE || $session->get('Perfil') != 'ADMINISTRADOR') {
            $session->destroy();
            return redirect('/');
        }

        // Retornar en $data los datos de las tablas relacionadas
        $animalModel = model('AnimalModel');
        $areasModel = model('AreasModel');
        $especiesModel = model('EspeciesModel');
        $data['animales'] = $animalModel->paginate(10);
        $data['areas'] = $areasModel->findAll();
        $data['especies'] = $especiesModel->findAll();
---
SELECT *
FROM `animal`
WHERE `animal`.`deleted_at` IS NULL
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `animal`
WHERE `animal`.`deleted_at` IS NULL
SELECT *
FROM `area`
WHERE `area`.`deleted_at` IS NULL
SELECT *
FROM `especie`

    public function editarAnimal($idAnimal)
    {
        $session = session();
        if ($session->get('logged_in') != TRUE || $session->get('Perfil') != 'ADMINISTRADOR') {
            $session->destroy();
            return redirect('/');
        }

        $areas = model('AreasModel');
        $especieModel = model('EspeciesModel');
        $animalModel = model('AnimalModel');
        $data['areas'] = $areas->findAll();
        $data['animal'] = $animalModel->find($idAnimal);
        $data['especies'] = $especieModel->findAll();
---
SELECT *
FROM `area`
WHERE `area`.`deleted_at` IS NULL
SELECT *
FROM `especie`

    public function updateAnimal()
    {
        $animal = model('AnimalModel');
        $data = [
            "especie" => $_POST['especie'],
            "nombre" => $_POST['nombre'],
            "sexo" => $_POST['sexo'],
            'edad' => $_POST['edad'],
            'descripcion' => $_POST['descripcion'],
            'area' => $_POST['area'],
            'dieta' => $_POST['dieta'],
            'expectativaDeVida' => $_POST['expectativaDeVida'],
            'fechaNacimiento' => $_POST['fechaNacimiento'],
            'historialMedico' => $_POST['historialMedico']
        ];
        $animal->update($_POST['idAnimal'], $data);
---
UPDATE `animal` SET `especie` = '1', `nombre` = 'fghjk', `sexo` = 'MACHO', `edad` = '7', `descripcion` = 'ghjkl;', `area` = '1', `dieta` = 'bnjmkl;', `expectativaDeVida` = '77', `fechaNacimiento` = '1999-01-07', `historialMedico` = 'hjkl'
WHERE `animal`.`numeroIdentificador` IN ('44')