PROYECTO D.A.W/app/Controllers/AdminController.php

SELECT *
FROM `animal`
SELECT *
FROM `area`
SELECT *
FROM `especie`
---
    public function animalTabla()
    {
        $animalModel = model('AnimalModel');
        $areasModel = model('AreasModel');
        $especiesModel = model('EspeciesModel');
        $data['animales'] = $animalModel->findAll();
        $data['areas'] = $areasModel->findAll();
        $data['especies'] = $especiesModel->findAll();

SELECT *
FROM `especie`
---
    public function editarAnimal($idAnimal)
    {
        $especieModel = model('EspeciesModel');
        $animalModel = model('AnimalModel');
        $data['animal'] = $animalModel->find($idAnimal);
        $data['especies'] = $especieModel->findAll();