PROYECTO D.A.W/app/Controllers/ClienteController.php

    public function animalesTabla()
    {

        $session = session();
        if($session->get('logged_in')!=TRUE){
            $session->destroy();
            return redirect('/');
        }
        $animalModel = model('AnimalModel');
        $areasModel = model('AreasModel');
        $especiesModel = model('EspeciesModel');
        $data['animales'] = $animalModel->findAll();
        $data['areas'] = $areasModel->findAll();
        $data['especies'] = $especiesModel->findAll();
---
SELECT *
FROM `animal`
WHERE `animal`.`deleted_at` IS NULL
SELECT *
FROM `area`
WHERE `area`.`deleted_at` IS NULL
SELECT *
FROM `especie`