PROYECTOD.A.W/app/Controllers/Animal.php

    public function animalTabla()
    {
        $session = session();
        if ($session->get('logged_in') != TRUE || $session->get('Perfil') != 'ADMINISTRADOR') {
            $session->destroy();
            return redirect('/');
        }

        // Retornar en $data los datos de las tablas relacionadas
        $animalModel = model('AnimalModel');
        $areasModel = model('AreasModel');
        $especiesModel = model('EspeciesModel');
        $data['animales'] = $animalModel->paginate(10);
        $data['areas'] = $areasModel->findAll();
        $data['especies'] = $especiesModel->findAll();
---
SELECT *
FROM `animal`
WHERE `animal`.`deleted_at` IS NULL
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `animal`
WHERE `animal`.`deleted_at` IS NULL
SELECT *
FROM `area`
WHERE `area`.`deleted_at` IS NULL
SELECT *
FROM `especie`

    public function editarAnimal($idAnimal)
    {
        $session = session();
        if ($session->get('logged_in') != TRUE || $session->get('Perfil') != 'ADMINISTRADOR') {
            $session->destroy();
            return redirect('/');
        }

        $areas = model('AreasModel');
        $especieModel = model('EspeciesModel');
        $animalModel = model('AnimalModel');
        $data['areas'] = $areas->findAll();
        $data['animal'] = $animalModel->find($idAnimal);
        $data['especies'] = $especieModel->findAll();
---
SELECT *
FROM `area`
WHERE `area`.`deleted_at` IS NULL
SELECT *
FROM `especie`