PROYECTOD.A.W/app/Controllers/Atracciones.php

    public function atraccionesTabla()
    {
        $session = session();
        if ($session->get('logged_in') != TRUE || $session->get('Perfil') != 'ADMINISTRADOR') {
            $session->destroy();
            return redirect('/');
        }
        $animales = model('AnimalModel');
        $areas = model('AreasModel');
        $atracciones = model('AtraccionesModel');
        $data['animales'] = $animales->findAll();
        $data['areas'] = $areas->findAll();
        $data['atracciones'] = $atracciones->paginate(10);
        $data['registros'] = count($atracciones->findAll());
---
SELECT *
FROM `animal`
WHERE `animal`.`deleted_at` IS NULL
SELECT *
FROM `area`
WHERE `area`.`deleted_at` IS NULL
SELECT *
FROM `atraccion`
WHERE `atraccion`.`deleted_at` IS NULL
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `atraccion`
WHERE `atraccion`.`deleted_at` IS NULL
SELECT *
FROM `atraccion`
WHERE `atraccion`.`deleted_at` IS NULL

    public function editarAtraccion($id)
    {
        $session = session();
        if ($session->get('logged_in') != TRUE || $session->get('Perfil') != 'ADMINISTRADOR') {
            $session->destroy();
            return redirect('/');
        }

        $animales = model('AnimalModel');
        $areas = model('AreasModel');
        $data['animales'] = $animales->findAll();
        $data['areas'] = $areas->findAll();
        $atraccion = model('AtraccionesModel');
        $data['atraccion'] = $atraccion->find($id);
        $data['atracciones']=$atraccion->paginate(10);
        $data['pager'] = $atraccion->pager;
        $data['registros'] = count($atraccion->findAll());
---
SELECT *
FROM `animal`
WHERE `animal`.`deleted_at` IS NULL
SELECT *
FROM `area`
WHERE `area`.`deleted_at` IS NULL
SELECT *
FROM `atraccion`
WHERE `atraccion`.`deleted_at` IS NULL
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `atraccion`
WHERE `atraccion`.`deleted_at` IS NULL
SELECT *
FROM `atraccion`
WHERE `atraccion`.`deleted_at` IS NULL