PROYECTOD.A.W/app/Controllers/ClienteController.php

    public function atraccionesTabla()
    {
        $session = session();
        if ($session->get('logged_in') != TRUE) {
            $session->destroy();
            return redirect('/');
        }

        $atracciones = model('AtraccionesModel');
        $data['atracciones'] = $atracciones->findAll();
---
SELECT *
FROM `atraccion`
WHERE `atraccion`.`deleted_at` IS NULL