PROYECTOD.A.W/app/Controllers/Empleados.php

    public function empleadosTabla()
    {
        $session = session();
        if ($session->get('logged_in') != TRUE || $session->get('Perfil') != 'ADMINISTRADOR') {
            $session->destroy();
            return redirect('/');
        }

        $empleados = model('EmpleadoModel');
        $data['empleados'] = $empleados->paginate(10);
        $data['registros'] = count($empleados->findAll());
---
SELECT *
FROM `empleados`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `empleados`
SELECT *
FROM `empleados`