PROYECTOD.A.W/app/Controllers/Reservacion.php

    public function editarReservacion($id)
    {
        $session = session();
        if ($session->get('logged_in') != TRUE || $session->get('Perfil') != 'ADMINISTRADOR') {
            $session->destroy();
            return redirect('/');
        }

        $reservacion = model('ReservacionModel');
        $atracciones = model('AtraccionesModel');
        $usuario = model('Usuarios');
        $data['reservacion'] = $reservacion->find($id);
        $data['reservaciones'] = $reservacion->paginate(10);
        $data['registros'] = count($reservacion->findAll());
        $data['atracciones'] = $atracciones->findAll();
        $data['usuarios'] = $usuario->findAll();
---
SELECT *
FROM `reservacion`
WHERE `reservacion`.`deleted_at` IS NULL
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `reservacion`
WHERE `reservacion`.`deleted_at` IS NULL
SELECT *
FROM `reservacion`
WHERE `reservacion`.`deleted_at` IS NULL
SELECT *
FROM `atraccion`
WHERE `atraccion`.`deleted_at` IS NULL
SELECT *
FROM `usuario`
WHERE `usuario`.`deleted_at` IS NULL