PROYECTOD.A.W/app/Controllers/SesionController.php

SELECT *
FROM `usuario`
WHERE `correoElectronico` = 'liz152@gmail.com'
AND `contrasenia` = 'luna2003'
AND `usuario`.`deleted_at` IS NULL
---
    public function index()
    {
        $validation = \Config\Services::validation();
        if (strtolower($this->request->getMethod()) === 'get') {
            return view('common/header') .
                view('InicioSesion/iniciarSesion');
        }

        $rules = [
            'correo' => 'required',
            'contrasenia' => 'required'
        ];

        if (!$this->validate($rules)) {
            return view('common/header') .
                view('InicioSesion/iniciarSesion');
        } else {
            //si pasa las reglas
            $email = $_POST['correo'];
            $password = $_POST['contrasenia'];
            $usuarios = model('Usuarios');
            $data['usuario'] = $usuarios->where('correoElectronico', $email)
                ->where('contrasenia', $password)
                ->findAll();