PROYECTOD.A.W/app/Controllers/Usuarios.php

SELECT *
FROM `usuario`
WHERE `usuario`.`deleted_at` IS NULL
SELECT *
FROM `usuario`
WHERE `numeroControl` LIKE '%1%' ESCAPE '!'
AND `usuario`.`deleted_at` IS NULL
---
    public function buscarUsuario()
    {
        $session = session();
        if ($session->get('logged_in') != TRUE) {
            return redirect('/');
        }

        $usuarios = model('Usuarios');
        $data['usuarios'] = $usuarios->findAll();

        if (isset($_GET['Buscador']) && isset($_GET['Valor'])) {
            $buscador = $_GET['Buscador'];
            $valor = $_GET['Valor'];

            if ($buscador == 'Nombre') {
                $data['usuarios'] = $usuarios->like('nombre', $valor)->findAll();
            }

            if ($buscador == 'apellido_Paterno') {
                $data['usuarios'] = $usuarios->like('apellido_Paterno', $valor)->findAll();
            }

            if ($buscador == 'apellido_Materno') {
                $data['usuarios'] = $usuarios->like('apellido_Materno', $valor)->findAll();
            }

            if ($buscador == 'numeroControl') {
                $data['usuarios'] = $usuarios->like('numeroControl', $valor)->findAll();

SELECT *
FROM `usuario`
WHERE `usuario`.`deleted_at` IS NULL
---
        } else {
            $buscador = null;
            $valor = null;
            $data['usuarios'] = $usuarios->findAll();